#NoEnv  ; Recommended for performance and compatibility with future AutoHotkey releases.
#Warn  ; Enable warnings to assist with detecting common errors.
#SingleInstance force
SendMode Input  ; Recommended for new scripts due to its superior speed and reliability.
SetWorkingDir %A_ScriptDir%  ; Ensures a consistent starting directory.


:*?:^+^::ː
:*?:+long::ː
:*?:>+<::ː
:*?:?+?::ʔ
:*?:+gs::ʔ
:*?:?+.::ʕ
:*?:?+-::ʡ
:*?:?.+-::ʢ
:*?:^+?::ˀ
:*?:^+.?::ˤ
:*?:+ps::ˈ
:*?:+ss::ˌ

:*?:<<-<::‹
:*?:>>->::›
:*?:<+<::«
:*?:>+>::»

:*?:->::→
:*?:<-::←
:*?:=>::⇒

:*?:!.::¡
:*?:?.::¿

:*?:++-::±

:*?:a+'::á
:*?:a+\::à
:*?:a+^::â
:*?:a+o::å
:*?:a+~::ã
:*?:a+,::ą
:*?:a+c::ą
:*?:a+j::ą
:*?:a+n::ą
:*?:a+"::ä
:*?:a++.::ɐ
:*?:a+-::ā
:*?:a+e::æ
:*?:a+h::ɑ
:*?:ah+~::ɑ̃
:*?:ah+.::ɒ
:*?:a+u::ă
:*?:a+w::ɔ
:*?:aw+~::ɔ̃
:*?:^a::ª

:*?:b+r::ɓ
:*?:b+v::β
:*?:b++::ʙ

:*?:c+'::ć
:*?:c+,::ç
:*?:c+c::ç
:*?:c+^::ĉ
:*?:c+v::č
:*?:c+sh::ɕ
:*?:c+zh::ɕ

:*?:d+^::ď
:*?:d+h::ð
:*?:+eth::ð
:*?:d+-::đ
:*?:d+r::ɗ
:*?:d+zh::ʤ

:*?:e+'::é
:*?:e+\::è
:*?:e+^::ê
:*?:e+~::ẽ
:*?:e+,::ę
:*?:e+c::ę
:*?:e+j::ę
:*?:e+"::ë
:*?:e+.::ė
:*?:e++.::ə
:*?:e+-::ē
:*?:e+3::ɜ
:*?:e+h::ɛ
:*?:eh+~::ɛ̃
:*?:e3+r::ɝ
:*?:e+r::ɚ
:*?:e+u::ĕ
:*?:e+v::ě
:*?:^e::ᵊ
:*?:e+n::ę


:*?:g+^::ĝ
:*?:g+'::ґ
:*?:g+.::ġ
:*?:g+c::ģ
:*?:g+j::ģ
:*?:g+,::ģ
:*?:g+h::ɣ
:*?:g+r::ɠ
:*?:g+u::ğ
:*?:g++::ɢ
:*?:^gh::ˠ

:*?:h+^::ĥ
:*?:h+-::ħ
:*?:h+g::ɧ
:*?:h+r::ɦ
:*?:h++::ʜ
:*?:^h::ʰ
:*?:^+hr::ʱ
:*?:h+.::ɥ

:*?:i+'::í
:*?:i+\::ì
:*?:i+^::î
:*?:i+"::ï
:*?:i+-::ī
:*?:i++::ɪ
:*?:ih+"::ɪ̈
:*?:и+'::і
:*?:и+"::ї
:*?:i+u::ĭ
:*?:i+~::ĩ
:*?:i+,::į
:*?:i+j::į
:*?:i+c::į
:*?:i-.::ı
:*?:I+.::İ
:*?:+ibar::ɨ
:*?:i+/::ɨ

:*?:j+^::ĵ
:*?:j+sh::ʝ
:*?:j+zh::ʝ
:*?:^j::ʲ

:*?:k+c::ķ
:*?:k+j::ķ
:*?:k+,::ķ
:*?:k+^::k̂

:*?:l+~::ɫ
:*?:l+/::ł
:*?:l+-::ł
:*?:l+^::ľ
:*?:l+c::ļ
:*?:l+j::ļ
:*?:l+,::ļ
:*?:l+'::ĺ
:*?:l+l::ʎ
:*?:l+sh::ɬ
:*?:l+zh::ɮ
:*?:l++::ʟ
:*?:^l::ˡ

:*?:m+g::ɱ

:*?:n+'::ń
:*?:n+~::ñ
:*?:n+,::ņ
:*?:n+g::ŋ
:*?:+eng::ŋ
:*?:n+c::ņ
:*?:n+j::ɳ
:*?:n+y::ɲ
:*?:n+v::ň
:*?:n++::ɴ
:*?:^n::ⁿ

:*?:o+'::ó
:*?:o+\::ò
:*?:o+^::ô
:*?:o+~::õ
:*?:o+"::ö
:*?:o+/::ø
:*?:o+-::ō
:*?:o++"::ő
:*?:o+e::œ
:*?:o+u::ŏ
:*?:oe++::ɶ
:*?:^o::º

:*?:p+f::ɸ

:*?:r+,::ɽ
:*?:r+'::ŕ
:*?:r+j::ɽ
:*?:r+c::ɽ
:*?:r+.::ɹ
:*?:r+r::ɹ
:*?:rd+l::ɺ
:*?:r+d::ɾ
:*?:r+l::ɻ
:*?:rl+,::ɻ
:*?:rl+j::ɻ
:*?:rl+c::ɻ
:*?:r+v::ř
:*?:r++::ʀ
:*?:r.++::ʁ
:*?:^r::ʳ
:*?:+er::˞

:*?:s+'::ś
:*?:s+^::ŝ
:*?:s+j::ʂ
:*?:s+h::ʃ
:*?:+esh::ʃ
:*?:+schwa::ə
:*?:s+,::ș
:*?:s+c::ş
:*?:s+s::ß
:*?:s+v::š

:*?:t+j::ʈ
:*?:t+r::ʈ
:*?:t+h::þ
:*?:t+,::ț
:*?:t+^::ť
:*?:t+c::ţ
:*?:t+sh::ʧ
:*?:^t::ᵗ

:*?:u+'::ú
:*?:u+\::ù
:*?:u+^::û
:*?:u+"::ü
:*?:u++"::ű
:*?:u+/::ʉ
:*?:u+-::ū
:*?:u+,::ų
:*?:u+~::ũ
:*?:u+c::ų
:*?:u+j::ɥ
:*?:u+h::ʌ
:*?:u+o::ů
:*?:u+s::ʊ
:*?:u+u::ŭ
:*?:u+w::ɯ

:*?:x+h::χ
:*?:x+q::χ

:*?:w+,::ɰ
:*?:w+c::ɰ
:*?:w+j::ɰ
:*?:w+^::ŵ
:*?:w+h::ʍ
:*?:^w::ʷ

:*?:y+'::ý
:*?:y+"::ӱ
:*?:y+^::ŷ
:*?:y++::ʏ

:*?:z+'::ź
:*?:z+.::ż
:*?:z+,::ʐ
:*?:z+c::ʐ
:*?:z+j::ʐ
:*?:z+h::ʒ
:*?:+yogh::ʒ
:*?:z+sh::ʑ
:*?:z+zh::ʑ
:*?:z+v::ž

:*?:+alpha::α
:*?:+beta::β
:*?:+gamma::γ
:*?:+delta::δ
:*?:+epsilon::ε
:*?:+zeta::ζ
:*?:+eta::η
:*?:+theta::θ
:*?:+iota::ι
:*?:+kappa::κ
:*?:+lambda::λ
:*?:+mu::μ
:*?:+nu::ν
:*?:+ksi::ξ
:*?:+xi::ξ
:*?:+omicron::ο
:*?:+pi::π
:*?:+rho::ρ
:*?:+sigma::σ
:*?:+sigmac::ϲ
:*?:+sigmaf::ς
:*?:+tau::τ
:*?:+upsilon::υ
:*?:+phi::φ
:*?:+chi::χ
:*?:+psi::ψ
:*?:+omega::ω